/* eslint-disable sorting/sort-object-props */

/*
 * emoji refs.
 *
 * http://unicode.org/emoji/charts/full-emoji-list.html
 * http://unicode.org/emoji/charts/emoji-versions.html
 */

const emoja = {
  '😁': ['笑う', '笑い'],
  '😂': ['泣き笑い', '泣く', '泣き'],
  '😃': ['笑顔'],
  '😄': ['笑顔'],
  '😅': ['あせっ', '焦っ', 'あせる', 'あせり', '焦り', '焦る'],
  '😆': ['大笑い', '爆笑'],
  '😉': ['ウインク'],
  '😊': ['えがお', 'ほほえ', '微笑'],
  '😋': ['おいしい', 'うまい'],
  '😎': ['サングラス'],
  '😍': ['メロメロ'],
  '😘': ['投げキッス'],
  '😚': ['チュー'],
  '😇': ['天使', '昇天'],
  '😐': ['ムー'],
  '😶': ['無言'],
  '😏': ['ニヤり', 'ニヤリ', 'にやり'],
  '😪': ['ねむい', '眠い', 'ネムイ'],
  '😜': ['ベー'],
  '😥': ['こまる', '困る'],
  '😷': ['マスク', '風邪', '病気'],
  '😤': ['プンプン'],
  '😢': ['悲し', '泣く', '泣き', '涙'],
  '😭': ['大泣き', '号泣'],
  '😰': ['やばい'],
  '😱': ['ガーン', 'がーん', '驚'],
  '😳': ['ドキッ'],
  '😡': ['怒'],
  '😠': ['ムッ'],
  '😈': ['悪魔の笑い'],
  '👿': ['悪魔'],
  '👹': ['なまはげ', 'ナマハゲ', 'おに', 'オニ', '鬼'],
  '👺': ['てんぐ', '天狗'],
  '💀': ['ドクロ', 'どくろ', '髑髏'],
  '👻': ['ゴースト', 'おばけ', 'お化け', 'オバケ', '幽霊'],
  '👽': ['エイリアン', '宇宙人'],
  '👾': ['インベーダー'],
  '💩': ['うんこ', 'うんち', 'クソ', 'くそ', '糞'],
  '🐱': ['にゃー', 'ニャー'],
  '🙈': ['見ざる', '見猿'],
  '🙊': ['言わざる', '言わ猿'],
  '🙉': ['聞かざる', '聞か猿'],
  '👦': ['おとこのこ', '男の子', '男子', '息子', '児童', '子供', '子ども'],
  '👧': ['おんなのこ', '女の子', '女子', '娘'],
  '👨': ['おとう', 'お父', 'おじ', 'おっさん', '父親', '男性'],
  '👩': ['おかあ', 'お母', 'おば', 'ババア', '母親', '女性'],
  '👴': ['おじい', 'お爺', 'ジジイ', '祖父'],
  '👵': ['おばあ', 'お婆', 'おバア', '祖母'],
  '🍣': ['おすし', 'お寿司', 'おスシ', 'お寿し', 'お鮨', 'すし', 'スシ', '寿司', '寿し', '鮨'],
  '🐈': ['ねこ', 'ネコ', '猫']
};

export default emoja;
