/* eslint-disable sorting/sort-object-props */

/*
 * emoji refs.
 *
 * http://unicode.org/emoji/charts/full-emoji-list.html
 * http://unicode.org/emoji/charts/emoji-versions.html
 */

const emoja = {
  '😁': ['笑う', '笑い'],
  '😂': ['泣き笑い', '泣く', '泣き'],
  '😃': ['笑顔'],
  '😄': ['笑顔'],
  '😅': ['あせっ', '焦っ', 'あせる', 'あせり', '焦り', '焦る'],
  '😆': ['大笑い', '爆笑'],
  '😉': ['ウインク'],
  '😊': ['えがお', 'ほほえ', '微笑'],
  '😋': ['おいしい', 'うまい'],
  '😎': ['サングラス'],
  '😍': ['メロメロ'],
  '😘': ['投げキッス'],
  '😚': ['チュー'],
  '😇': ['天使', '昇天'],
  '😐': ['ムー'],
  '😶': ['無言'],
  '😏': ['ニヤり', 'ニヤリ', 'にやり'],
  '😪': ['ねむい', '眠い', 'ネムイ'],
  '😜': ['ベー'],
  '😥': ['こまる', '困る'],
  '😷': ['マスク', '風邪', '病気'],
  '😤': ['プンプン'],
  '😢': ['悲し', '泣く', '泣き', '涙'],
  '😭': ['大泣き', '号泣'],
  '😰': ['やばい'],
  '😱': ['ガーン', 'がーん', '驚'],
  '😳': ['ドキッ'],
  '😡': ['怒'],
  '😠': ['ムッ'],
  '😈': ['悪魔の笑い'],
  '👿': ['悪魔'],
  '👹': ['なまはげ', 'ナマハゲ', 'おに', 'オニ', '鬼'],
  '🍣': ['おすし', 'お寿司', 'おスシ', 'お寿し', 'お鮨', 'すし', 'スシ', '寿司', '寿し', '鮨']
};

export default emoja;
